Revit 2026 API

# PanelScheduleTemplateHasSameType Method

---

Checks if given template has the same panel schedule type with this template.

**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public bool HasSameType(
	PanelScheduleTemplate otherTemplate
)
```
```vb
Public Function HasSameType (
	otherTemplate As PanelScheduleTemplate
) As Boolean
```
```cpp
public:
bool HasSameType(
	PanelScheduleTemplate^ otherTemplate
)
```
```fsharp
member HasSameType :
        otherTemplate : PanelScheduleTemplate -> bool
```

#### Parameters

otherTemplate PanelScheduleTemplate
     The given template to check.

#### Return Value

Boolean True if the given template has the same panel schedule type with this template, false otherwise.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

The panel schedule type is the enum type of PanelScheduleType class (Branch, switchboard, data etc.)

#### Reference

PanelScheduleTemplate Class

Autodesk.Revit.DB.Electrical Namespace